Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་སྐྱེ་བོའི་ཚོགས་དེ་རྣམས་ཀྱིས་རང་སངས་རྒྱས་རྣམས་ལ་ཞུས་པ།
en: Then the people asked the self-awakened ones, ‘Noble ones, our seeds that have grown sprang up as gourds.

source: འཕགས་པ་དག་བདག་ཅག་གི་ལོ་ཐོག་བསྐྲུན་པ་གང་ལགས་པ་དེ་དག་ཀུ་བར་སྐྱེས་པར་གྱུར་ན་དེ་ལ་ཇི་ལྟར་བསྒྲུབ་པར་བགྱི།
en: What should we do about them?’

source: མ་བཅད་པར་སྐྲུན་ཅིག །དེ་རྣམས་ཀྱིས་བསྐྲུན་པ་ལས་མེ་ཏོག་དང་འབྲས་བུ་རྫ་མའི་ཚད་ཙམ་ཆགས་སོ།
en: “When they grew the gourds, each plant blossomed, producing a fruit as large as a pot.

source: །དེ་ནས་དེ་རྣམས་ཀྱིས་རང་སངས་རྒྱས་དེ་དག་ལ་རྒྱས་པར་སྨྲས་པ་དང་། དེ་རྣམས་ཀྱིས་སྨྲས་པ།
en: They explained this in detail to the self-awakened ones.

source: མ་བཅད་ཅིག་དང་། རང་ཉིད་སྨིན་ནས་གས་པར་འགྱུར་རོ།
en: They were then told, ‘You should not cut them. They will burst by themselves after having matured.’

source: །ཇི་ཙམ་ན་དེ་རྣམས་སྨིན་ནས་གས་པ་དང་། གང་གིས་ས་བོན་ཇི་ལྟ་བུ་བཏབ་པ་དེའི་དེ་ཁོ་ན་ལྟ་བུ་ཤ་སྟག་གིས་གང་བར་གྱུར་ཏོ།
en: “Later, they did burst after having matured. Each of them was full of the same kind of seeds as each person had sowed.

source: །དེ་ནས་མུ་གེ་རྒྱུན་ཆད་དེ་ལོ་ལེགས་པར་གྱུར་ནས་ཡུལ་ཕྱོགས་སྣ་ཚོགས་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་དང་། སྲོག་ཆགས་གང་དག་མུ་གེས་འཇིགས་སྐྲག་ནས་དོང་བ་རྣམས་ཀྱང་ཡུལ་བཱ་རཱ་ཎ་སཱིར་འོངས་སོ།
en: When the famine had thereby ceased and there was an abundant harvest, people and other beings who had left for fear of the famine and were living in various other provinces came back to Vārāṇasī.

source: །དེ་ནས་མུ་གེ་རྒྱུན་ཆད་དེ་ལོ་ལེགས་པར་གྱུར་ནས་ཁྱིམ་བདག་འདུམ་བྱེད་ཀྱིས་དེ་ན་རང་སངས་རྒྱས་སྟོང་ལ་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་སྣ་ཚོགས་དང་། ཚོད་མ་རོ་དང་ལྡན་པ་རྣམས་ཀྱིས་ཚིམ་པར་བྱས་ཏེ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Also, when the famine had ceased and there was an abundant harvest, the householder Saṃdhāna satisfied the thousand self-awakened ones with a pure and fine meal with tasty vegetables and spoke these verses:

source: བློ་ལྡན་མཁས་པས་ནོར་དང་ནི། །དད་པ་ཤེས་རབ་རྙེད་ནས་ནི།
en: “ ‘Having attained wealth, faith, and insight, An intelligent, wise man

source: །སྐྱེས་བུ་དེ་ཡིས་རྟག་པར་ཡང་།
en: Always gives gifts,

source: །འདོད་ཆགས་བྲལ་ལ་ཡོན་དབུལ་ལོ།
en: Being free from attachment. “ ‘The family of one who offers Food to the steadfast

source: །རྫུ་འཕྲུལ་ལྡན་ཞིང་འོད་དང་ལྡན།
en: Possessed of magical power, splendor,

source: །ཁ་དོག་ལྡན་ཞིང་གྲགས་ལྡན་པའི། །བརྟན་རྣམས་གང་གིས་བཤོས་གསོལ་བ། དེ་ཡི་རིགས་ནི་བདེ་བར་འཕེལ། །དེ་ལྟས་ཚུལ་ཁྲིམས་ཕུན་ཚོགས་པའི། །ཡོན་གནས་དག་ལ་ཡོན་ཕུལ་ན།
en: Beautiful appearance, and fame will prosper. “ ‘Thus, those who give gifts To those worthy of veneration and perfect in conduct

source: །འཇིག་རྟེན་འདི་དང་ཕ་རོལ་དུ། །བདེ་བ་དག་ཏུ་འགྱུར་བ་ཉིད།
en: Will be happy In this world and the next.’

source: །རྒྱལ་པོ་ཆེན་པོ་དེའི་ཚེ་དེའི་དུས་ན་ཁྱིམ་བདག་འདུམ་བྱེད་ཅེས་བྱ་བར་གྱུར་པ་གང་གིས་མུ་གེ་ལོ་བཅུ་གཉིས་སུ་བྱུང་བ་ན་རང་སངས་རྒྱས་སྟོང་ལ་བསོད་སྙོམས་སྦྱར་ཅིང་དེའི་གྲོགས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བྱས་པ་དེ་གཞན་ཞིག་ཡིན་སྙམ་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that the one who was that householder named Saṃdhāna at that time, on that occasion, who provided almsfood for a thousand self-awakened ones when there was a famine for twelve years, and whom Śakra, Lord of the Gods, helped, was someone else, you should think otherwise.

source: འོན་ཀྱང་ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་ཁྱིམ་བདག་འདུམ་བྱེད་ཅེས་བྱ་བ་དེར་གྱུར་ཏེ།
en: I was the householder Saṃdhāna at that time, on that occasion.

source: ང་ཉིད་ཀྱིས་དེ་ན་མུ་གེ་ལོ་བཅུ་གཉིས་སུ་བྱུང་བ་ན་རང་སངས་རྒྱས་སྟོང་ལ་བསོད་སྙོམས་སྦྱར་བས་ངའི་གྲོགས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བྱས་སོ།
en: I provided almsfood for a thousand self-awakened ones when there was a famine for twelve years, and Śakra, Lord of the Gods, helped me.

source: །རྒྱལ་པོ་ཆེན་པོ་ངའི་སྦྱིན་པའམ། སྦྱིན་པའི་བགོ་བཤའ་དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་བོ་སྙམ་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that I attained supreme and complete awakening by these donations or distributions of donations, you should think otherwise;

source: འོན་ཀྱང་ངའི་སྦྱིན་པ་དེ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྒྱུ་ཙམ་དང་། རྐྱེན་ཙམ་དང་། ཚོགས་ཙམ་ཡིན་ནོ།། །།སྡོམ་ལ།
en: these donations of mine were only a cause, only a condition, only a preparation for supreme and complete awakening.” G. Former Life Stories II Summary of Contents:

source: སྤྲིན་ཤུགས་དབང་པོ་སྦྲུལ་མགོ་གཉིས།
en: Bālāha, A King, The Snake, Two Heads, The Lapwing, The Parrot,

source: །དེ་བཞིན་ཆུ་སྲེག་ནེ་ཙོ་དང་། །སྟོན་མོ་རུ་སྦལ་སྡེ་བཟངས་དང་། །དེད་དཔོན་ཚོགས་སུ་བསྡུས་པ་ཡིན།
en: The Banquet, The Turtle, Susena, And Merchants are summarized. 1.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་ཕྱིར་སེམས་ཅན་རྣམས་རྗེས་སུ་གཟུང་བ་བྱས་པ་གང་ཡིན་པ་དེ་ཉོན་ཅིག །རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་འཛམ་བུའི་གླིང་གི་དོན་མཐུན་ནོར་ཚོལ་བ་རབ་ཏུ་མང་པོ་དག་ཅིག་རྒྱ་མཚོའི་གྲུ་བོ་ཆེ་བསྒྲུབས་ཏེ།
en: Bālāha “Great King, again, seeking supreme and complete awakening, I helped beings. Listen to that story. “Great King, once many merchants from the continent of Jambu, jewel seekers, arranged a ship.

source: རྒྱ་མཚོ་ཆེན་པོར་འཇུག་པར་འདོད་ནས་དེ་རྣམས་འདི་སྙམ་དུ་སེམས་ཏེ། ཤེས་ལྡན་དག་བདག་ཅག་རྒྱ་མཚོ་ཆེན་པོར་ཞུགས་པ་རྣམས་འདི་ལྟ་སྟེ། གཅིག་ལ་གཅིག་ཕན་ཐོགས་པར་མངོན་པ་མེད་ཀྱིས། མ་ལ་བདག་ཅག་ནོར་ཚོལ་བ་རྣམས་སོ་སོ་ནས་ཕོངས་པ་ན་དགོས་པ་རྐྱལ་གྱི་ཆ་སྤྱད་དག་ཁྱེར་ཏེ་རྒྱ་མཚོ་ཆེན་པོར་འཇུག་པར་བྱའོ་ཞེས་དེ་ལྟར་ཆས་བཅད་ནས་ནོར་ཚོལ་བ་རྣམས་སོ་སོ་ནས་ཕོངས་པ་ན་དགོས་པ་རྐྱལ་གྱི་ཆ་སྤྱད་ཁ་ཅིག་གིས་ནི་ཤིང་ཤལ་མ་ལིའི་སྤང་ལེབ། ཁ་ཅིག་གིས་ནི་རས་སྒྱེ་ནང་ཚངས་ཅན། ཁ་ཅིག་གིས་ནི་ཀུ་བ་བརྒྱུས་པ། ཁ་ཅིག་གིས་ནི་ར་རྐྱལ་ཁྱེར་ཏེ་རྒྱ་མཚོ་ཆེན་པོར་ཞུགས་སོ།
en: Wanting to take to the great ocean, they thought thus: ‘Sirs, since, once we take to the great ocean, it is not clear if we will be able to help each other, each of us jewel seekers should now take a life buoy, which will be necessary in case of danger, and take to the great ocean.’ “And so, each of the jewel seekers did take his own life buoy, which would be necessary in case of danger—some took a shield made from the silk-cotton tree, some a wadded bag, some stringed gourds, and some a bag made of goat skin—and they then took to the great ocean.

source: །དེ་རྣམས་རྒྱ་མཚོ་ཆེན་པོའི་དབུས་སུ་ཕྱིན་པ་དང་། ཆུ་སྲིན་ཉའི་རིགས་ཀྱིས་རྒྱ་མཚོའི་གྲུ་བོ་ཆེ་བཤིག་གོ།
en: When they arrived in the middle of the great ocean, the ship was broken up by a makara.

source: །གྲུ་བོ་ཆེ་བཤིག་པ་དང་། དེ་རྣམས་རྐྱལ་པ་རེ་རེ་ལ་ཞོན་ཏེ་ཆུ་ཇི་ལྟ་བ་བཞིན་དུ་ཁྱེར་ཏེ་དོང་བ་ལས།
en: After the ship had been broken up, each of them rode his own life buoy and was carried by the current.

source: དེ་རྣམས་ཀྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་རླུང་བྱང་ཕྱོགས་ནས་ལངས་ཏེ། དེས་ལྷོ་ཕྱོགས་ཀྱི་འགྲམ་དུ་ཁྱེར་བ་དང་། དེ་ན་བུད་མེད་གཟུགས་བཟང་མོ།
en: Wind caused by the maturation of their karma arose from the north and brought them to a shore in the south.

source: མཛེས་མ་བལྟ་ན་སྡུག་པ་དག་ཡོད་དེ། དེ་དག་གིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཇོ་བོ་དག་ཚུར་སྤྱོན་བཞིན་བཟངས་དག་ཚུར་སྤྱོན།
en: There were women there who were well proportioned, attractive, and pleasant to behold. They said, ‘Come, masters.

source: བདག་ཅག་ཇོ་བོ་མ་མཆིས་པ་རྣམས་ཀྱི་ཇོ་བོ་དང་། ཁྱིམ་ཐབ་མ་མཆིས་པ་རྣམས་ཀྱི་ཁྱིམ་ཐབ་དང་། གནས་མ་མཆིས་པ་རྣམས་ཀྱི་གནས་དང་། གླིང་མ་མཆིས་པ་རྣམས་ཀྱི་གླིང་དང་། མགོན་མ་མཆིས་པ་རྣམས་ཀྱི་མགོན་དང་། སྐྱབས་མ་མཆིས་པ་རྣམས་ཀྱི་སྐྱབས་དང་། རྟེན་མ་མཆིས་པ་རྣམས་ཀྱི་རྟེན་མཛོད་ཅིག །འདི་དག་ནི་ཁྱོད་ཀྱི་ཟས་ཀྱི་ཁང་པ་དང་། སྐོམ་གྱི་ཁང་པ་དང་། གོས་ཀྱི་ཁང་པ་དང་། གནས་མལ་གྱི་ཁང་པ་དང་། དགའ་བར་འགྱུར་བའི་ཀུན་དགའ་ར་བ་དང་། དགའ་བར་འགྱུར་བའི་ཚལ་དང་། དགའ་བར་འགྱུར་བའི་རྫིང་དང་། འཛམ་བུའི་གླིང་གི་རིན་པོ་ཆེ་རབ་ཏུ་མང་པོ་འདི་ལྟ་སྟེ།
en: Come, sirs. Be masters to us who have no masters, husbands to us who have no husbands, homes to us who have no homes, islands to us who have no islands, protectors to us who have no protectors, refuges to us who have no refuges, support to us who have no support. These are your houses for food, houses for drink, houses for clothes, houses for bedding, parks for pleasure, forests for pleasure, ponds for pleasure, and many treasures from the continent of Jambu:

source: ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་ཌཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། དངུལ་དང་། གསེར་དང་། རྡོའི་སྙིང་པོ་དང་། སྤུག་དང་། པད་མ་རཱ་ག་དང་། དུང་དང་། གཡས་སུ་འཁྱིལ་པ་དག་ལགས་ཀྱིས་ཁྱེད་ཚུར་སྤྱོན།
en: jewels, pearls, lapis lazuli, conch shells, glass, coral, silver, gold, agate, amber, rubies, and dextral shells. You should come.

source: བདག་ཅག་དང་ལྷན་ཅིག་རྩེད་མོ་བགྱི། དགའ་བར་བགྱི། དགའ་མགུར་སྤྱད་པར་བགྱིའོ།
en: Play, make love, and enjoy yourselves with us.

source: །ཁྱེད་ཅག་ལས་སུ་ཡང་སྨྱོས་ཀྱང་ལྷོ་ཕྱོགས་ཀྱི་ལམ་དུ་མ་བཞུད་ཅིག །དེ་དག་བུད་མེད་དེ་རྣམས་དང་ལྷན་ཅིག་རྩེ་བར་བྱེད།
en: But none of you should go to the southern road, even if he becomes mad.’

source: དགའ་བར་བྱེད། དགའ་མགུར་སྤྱོད་པར་བྱེད་དེ། དེ་དག་དེ་རྣམས་དང་ལྷན་ཅིག་རྩེ་བར་བྱེད། དགའ་བར་བྱེད།
en: “They and the women played, made love, and enjoyed themselves.

source: དགའ་མགུར་སྤྱོད་པར་བྱེད་པ་ལས་བུ་ཕོ་དང་། བུ་མོ་དག་བཙས་སོ།
en: Thus, sons and daughters were born.

source: །དེ་ནས་ཚོང་པ་མཁས་པའི་རང་བཞིན་ཅན་ཞིག་འདི་སྙམ་དུ་སེམས་ཏེ། ཅིའི་ཕྱིར་བུད་མེད་དེ་དག་གིས་ལྷོ་ཕྱོགས་ཀྱི་ལམ་ལྷག་པར་བསྲུང་བར་སེམས།
en: “Thereupon a certain merchant of a wise nature thought, ‘Why do those women especially guard the southern road?

source: མ་ལ་བདག་གིས་བུད་མེད་གང་དང་ལྷན་ཅིག་ཉལ་བ་དེ་མལ་དུ་གཉིད་ལོག་པར་རིག་ནས་བགས་ཀྱིས་དལ་བུས་དལ་བུས་མལ་ནས་བབས་ལ་ལྷོ་ཕྱོགས་ཀྱི་ལམ་དུ་འགྲོའོ་སྙམ་ནས།
en: I will now make sure that the woman with whom I sleep has fallen asleep, get down from the bed carefully and slowly, and go to the southern road.’

source: དེ་དེ་ལྟར་ངེས་པར་བྱས་ནས་བུད་མེད་གང་དང་ལྷན་ཅིག་ཉལ་བ་དེ་གཉིད་ཀྱིས་ལོག་པར་རིག་ནས་བགས་ཀྱིས་དལ་བུས་དལ་བུས་མལ་ནས་བབས་ཏེ་རལ་གྲི་རྣོན་པོ་མཆན་དུ་ཐོགས་ནས་ལྷོ་ཕྱོགས་ཀྱི་ལམ་དུ་སོང་བ་དང་། དེས་དེ་ན་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་སྨྲེ་སྔགས་འདོན་པའི་སྒྲ་ཀྱི་ཧུད་མ།
en: “Having thus decided, he made sure that the woman with whom he slept had fallen asleep, got down from the bed carefully and slowly, and went to the southern road, carrying a sharp sword under his arm. “He heard the lamenting voices of many people there: ‘Alas, mother!

source: ཀྱི་ཧུད་ཕ།
en: Alas, father!

source: ཀྱི་ཧུད་སྲིང་མོ།
en: Alas, sister!

source: ཀྱི་ཧུད་འཛམ་བུའི་གླིང་བཀྲ་བས་སྤངས་སམ།
en: Alas, the beautiful continent of Jambu!

source: འདི་ལྟར་འཛམ་བུའི་གླིང་ན་རེ་སྐྱིད་ཅེས་སྒྲ་འབྱིན་པ་དག་ཐོས་སོ། །ཐོས་ནས་ཀྱང་དེ་འཇིགས་པར་གྱུར། རྨོངས་པར་གྱུར། སྐྱི་བུང་ཞེས་བྱེད་པར་གྱུར་ཏོ།
en: Have they abandoned us while the continent of Jambu is said to remain happy?’ Having heard this, he was frightened, upset, and dumbfounded.

source: །ད་ནས་ཚོང་པ་མཁས་པའི་རང་བཞིན་ཅན་དེས་འཇིགས་པ་དང་། སྐྱི་བུང་ཞེས་བྱེད་དེ་ཤིན་ཏུ་ལེགས་པར་བསལ་ནས་ལྷོ་ཕྱོགས་ཀྱི་ལམ་དེ་ཁོ་ནའི་རྗེས་སུ་སོང་བ་དང་། དེས་དེ་ན་ལྕགས་མཁར་ཆེན་པོ་མཐོ་ཞིང་རྒྱ་ཆེ་བ་ཞིག་མཐོང་ནས།
en: Then, after being frightened, upset, and dumbfounded, the merchant took heart and went along the southern road. He saw there a big, towering, vast iron castle.

source: དེས་གྲོང་ཁྱེར་དེའི་མཐའ་ཁོར་ཁོར་ཡུག་ཏུ་བསྐོར་ན། ཅི་ནས་ཀྱང་སྒོ་ཅུང་ཟད་ཅིག་རྙེད་གྲང་སྙམ་ནས། དེས་གྲོང་ཁྱེར་དེའི་མཐའ་ཁོར་ཁོར་ཡུག་ཏུ་བསྐོར་བ་དང་། ཆུང་ངུ་ན་བྱི་ལའམ་སྦྲུལ་འཛུལ་བའི་སྒོ་ཙམ་ཡང་མ་རྙེད་དོ།
en: He walked around the castle, and although he had done so, thinking, ‘By all means, I must find some entrance,’ he did not find even an entrance through which a cat or a snake could slip in.

source: །དེ་ན་ཤིང་ཤི་རི་ཤ་ཞེས་བྱ་བ་སྦོམ་ལ་རིང་བ་ཞིག་མཐོང་ནས།
en: He did see there was a big, tall tree called śirīṣa there.

source: དེ་ནས་ཚོང་པ་མཁས་པའི་རང་བཞིན་ཅན་གྱིས་ཤིང་ཤི་རི་ཤ་དེ་ལ་བགས་ཀྱིས་དལ་བུས་དལ་བུས་འཛེགས་ནས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཤེས་ལྡན་དག་ཅིའི་ཕྱིར་ཀྱི་ཧུད་མ།
en: Then the wise-natured merchant carefully climbed the śirīṣa tree and called out to the many people, ‘Sirs, why are you lamenting “Alas, mother!

source: འདི་ལྟར་འཛམ་བུའི་གླིང་ན་རེ་སྐྱིད་ཅེས་ཤིན་ཏུ་སྨྲེ་སྔགས་འདོན།
en: Have they abandoned us while the continent of Jambu is said to remain happy?” ’

source: དེ་རྣམས་ཀྱིས་སྨྲས་པ། ཀྱེ་ནང་རྗེ་བདག་ཅག་འཛམ་བུའི་གླིང་གི་དོན་མཐུན་ནོར་ཚོལ་བ་རབ་ཏུ་མང་པོ་དག་ཅིག་རྒྱ་མཚོའི་གྲུ་བོ་ཆེ་བསྒྲུབས་ཏེ།
en: “ ‘Good sir,’ they answered, ‘we are many merchants, jewel seekers, from the continent of Jambu.

source: རྒྱ་མཚོ་ཆེན་པོར་འཇུག་པར་འདོད་པ་ལས་བདག་ཅག་འདི་སྙམ་དུ་སེམས་ཏེ། ཤེས་ལྡན་དག་བདག་ཅག་རྒྱ་མཚོ་ཆེན་པོར་ཞུགས་པ་རྣམས་འདི་ལྟ་སྟེ། གཅིག་ལ་གཅིག་ཕན་འདོགས་པར་མངོན་པ་མེད་ཀྱིས། མ་ལ་བདག་ཅག་ནོར་ཚོལ་བ་རྣམས་སོ་སོ་ནས་ཕོངས་པ་ན་དགོས་པ་རྐྱལ་གྱི་ཆ་སྤྱད་དག་ཁྱེར་ཏེ།
en: We arranged a ship and, wanting to take to the great ocean, we thought, “Sirs, since, once we take to the great ocean, it is not clear if we will be able to help each other, each of us jewel seekers should now take a life buoy, which will be necessary in case of danger, and take to the great ocean.”

source: རྒྱ་མཚོ་ཆེན་པོར་འཇུག་པར་བྱའོ་ཞེས་དེ་ནས་ཆས་བཅད་ནས་ནོར་ཚོལ་བ་རྣམས་སོ་སོ་ནས་ཕོངས་པ་ན་དགོས་པ་རྐྱལ་གྱི་ཆ་སྤྱད་ཁ་ཅིག་གིས་ནི་ཤིང་ཤལ་མ་ལིའི་སྤང་ལེབ། ཁ་ཅིག་གིས་ནི་རས་སྒྱེ་ནང་ཚངས་ཅན། ཁ་ཅིག་གིས་ནི་ཀུ་བ་བརྒྱུས་པ། ཁ་ཅིག་གིས་ནི་ར་རྐྱལ་ཁྱེར་ཏེ་རྒྱ་མཚོ་ཆེན་པོར་ཞུགས་སོ།
en: “ ‘Thus, each of the jewel seekers did take his own life buoy, which would be necessary in case of danger—some took a shield made from the silk-cotton tree, some a wadded bag, some stringed gourds, and some a bag made of goat skin—and we took to the great ocean.

source: །བདག་ཅག་རྒྱ་མཚོ་ཆེན་པོའི་དབུས་སུ་ཕྱིན་པ་དང་། ཆུ་སྲིན་ཉའི་རིགས་ཀྱིས་གྲུ་བོ་ཆེ་བཤིག་གོ།
en: When we arrived in the middle of the great ocean, the ship was broken up by a makara.

source: །གྲུ་བོ་ཆེ་བཤིག་ནས་བདག་ཅག་རྐྱལ་པ་རེ་རེ་ལ་ཞོན་ཏེ། ཆུ་ཇི་ལྟ་བ་བཞིན་ཁྱེར་ཏེ་དོང་བ་ལས།
en: After the ship was broken up, each of us rode his own life buoy and was carried by the current.

source: བདག་ཅག་གི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་རླུང་བྱང་ཕྱོགས་ནས་ལངས་ཏེ། དེས་བདག་ཅག་ལྷོ་ཕྱོགས་ཀྱི་འགྲམ་དུ་ཁྱེར་བ་དང་། དེ་ན་བུད་མེད་གཟུགས་བཟང་མོ། མཛེས་མ། བལྟ་ན་སྡུག་པ་དག་ཡོད་དེ།
en: Wind caused by the maturation of our karma arose from the north and brought us to a shore in the south. There were women there who were well proportioned, attractive, and pleasant to behold.

source: དེ་དག་གིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཇོ་བོ་དག་ཚུར་སྤྱོན།
en: They said, “Come, masters.

source: བཞིན་བཟངས་དག་ཚུར་སྤྱོན།
en: Come, sirs.

source: བདག་ཅག་ཇོ་བོ་མ་མཆིས་པ་རྣམས་ཀྱི་ཇོ་བོ་དང་། ཁྱིམ་ཐབ་མ་མཆིས་པ་རྣམས་ཀྱི་ཁྱིམ་ཐབ་དང་། གནས་མ་མཆིས་པ་རྣམས་ཀྱི་གནས་དང་། གླིང་མ་མཆིས་པ་རྣམས་ཀྱི་གླིང་དང་། མགོན་མ་མཆིས་པ་རྣམས་ཀྱི་མགོན་དང་། སྐྱབས་མ་མཆིས་པ་རྣམས་ཀྱི་སྐྱབས་དང་། རྟེན་མ་མཆིས་པ་རྣམས་ཀྱི་རྟེན་མཛོད་ཅིག །འདི་དག་ནི་ཁྱེད་ཀྱི་ཟས་ཀྱི་ཁང་པ་དང་། སྐོམ་གྱི་ཁང་པ་དང་། གོས་ཀྱི་ཁང་པ་དང་། གནས་མལ་གྱི་ཁང་པ་དང་། དགའ་བར་འགྱུར་བའི་ཀུན་དགའ་ར་བ་དང་། དགའ་བར་འགྱུར་བའི་ཚལ་དང་། དགའ་བར་འགྱུར་བའི་རྫིང་དང་། འཛམ་བུའི་གླིང་གི་རིན་པོ་ཆེ་རབ་ཏུ་མང་པོ་འདི་ལྟ་སྟེ། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་ཌཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། དངུལ་དང་། གསེར་དང་། རྡོའི་སྙིང་པོ་དང་། སྤུག་དང་། པད་མ་རཱ་ག་དང་། དུང་གཡས་སུ་འཁྱིལ་པ་དག་ལགས་ཀྱིས་ཁྱེད་ཚུར་སྤྱོན།
en: Be masters to us who have no masters, husbands to us who have no husbands, homes to us who have no homes, islands to us who have no islands, protectors to us who have no protectors, refuges to us who have no refuges, support to us who have no support. These are your houses for food, houses for drink, houses for clothes, houses for bedding, parks for pleasure, forests for pleasure, ponds for pleasure, and many treasures from the continent of Jambu, namely, jewels, pearls, lapis lazuli, conch shells, glass, coral, silver, gold, agate, amber, rubies, and dextral shells. You should come.

source: བདག་ཅག་དང་ལྷན་ཅིག་རྩེད་མོ་བགྱི། དགའ་བར་བགྱི། དགའ་མགུར་སྤྱད་པར་བགྱི།
en: Play, make love, and enjoy yourselves with us.

source: ཁྱེད་ཅག་ལས་སུ་ཡང་སྨྱོས་ཀྱང་ལྷོ་ཕྱོགས་ཀྱི་ལམ་དུ་མ་བཞུད་ཅིག །བདག་ཅག་བུད་མེད་དེ་དག་དང་ལྷན་ཅིག་རྩེ་བར་བྱེད།
en: But none of you should go to the southern road, even if he becomes mad.”

source: དགའ་བར་བྱེད། དགའ་མགུར་སྤྱོད་པར་བྱེད་དེ། བདག་ཅག་དེ་དག་དང་ལྷན་ཅིག་རྩེ་བར་བྱེད། དགའ་བར་བྱེད།
en: “ ‘We and the women played, made love, and enjoyed ourselves.

source: དགའ་མགུར་སྤྱོད་པར་བྱེད་པ་ལས་ཁྱེའུ་དང་བུ་མོ་དག་བཙས་ཏེ།
en: Thus, sons and daughters were born.

source: ཇི་སྲིད་འཛམ་བུའི་གླིང་གི་དོན་མཐུན་གཞན་རྣམས་ཀྱི་རྒྱ་མཚོའི་གྲུ་བོ་ཆེ་ཞིག་གོ་ཞེས་མ་ཐོས་པ་དེ་སྲིད་དུ་བུད་མེད་དེ་དག་དང་བདག་ཅག་ལྷན་ཅིག་རྩེ་བར་བྱེད། དགའ་བར་བྱེད། དགའ་མགུར་སྤྱོད་པར་བྱེད་པ་ལས།
en: “ ‘We and the women played, made love, and enjoyed ourselves until they heard of a ship of other merchants from the continent of Jambu.

source: གང་གི་ཚེ་བུད་མེད་རྣམས་ཀྱིས་འཛམ་བུའི་གླིང་གི་དོན་མཐུན་རབ་ཏུ་མང་པོ་གཞན་དག་ཀྱང་རྒྱ་མཚོ་ཆེན་པོའི་དབུས་སུ་ཕྱིན་པ་དང་། ཆུ་སྲིན་ཉའི་རིགས་ཀྱིས་རྒྱ་མཚོའི་གྲུ་བོ་ཆེ་བཤིག་གོ་ཞེས་ཐོས་ནས། དེ་ནས་བདག་ཅག་གི་དྲུང་དུ་འོངས་ཏེ། ཁ་ཅིག་ནི་ཟོས་སོ།
en: When they heard that another group of many merchants from the continent of Jambu had arrived in the middle of the ocean and their ship had been broken up by a makara, they came to us and ate some of us.

source: །སྐྱས་པ་ཟ་བར་བྱེད་པ་ན་ལྷག་རོལ་སྐྲའམ། སྤུའམ། སེན་མོའམ། སོ་ལུས་པ་གང་དག་ཡིན་པ་དེ་དག་ཀྱང་མ་ལུས་པར་ཟ་བར་བྱེད་དོ།
en: When they eat a man, they leave nothing, eating even the hair, body hair, nails, and teeth.

source: །དེ་རྣམས་ཟ་བར་བྱེད་པ་ན་ཁྲག་དྲོན་པོའི་ཐིགས་པ་ས་ལ་ལྷུང་བ་གང་དག་ཡོད་ན་ཡང་དེ་དག་ཀྱང་སོར་མོའི་རྩེ་མོ་རྣམས་ཀྱིས་བྲུད་དེ་ས་དང་བཅས་པར་ཁར་འཇུག་པར་བྱེད་དོ།
en: When they eat, if a drop of blood is spilled on the ground, they even dig that out with their fingers and put it into their mouths with the soil.

source: །བདག་ཅག་ཁ་ཅིག་ནི་ལྕགས་ཀྱི་མཁར་འདིར་བཅུག་གོ།
en: The rest of us were confined in this iron castle.

source: །ཀྱེ་ནང་རྗེ་འདི་དག་ནི་མིའི་བུད་མེད་མ་ཡིན་ཏེ། སྲིན་མོ་ཡིན་གྱིས་འདི་དག་ལས་བདག་ཉིད་སྲུངས་ཤིག །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཚོང་པ་མཁས་པའི་རང་བཞིན་ཅན་གྱིས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: O good sir, these women are not human. They are rākṣasīs. So, protect yourself from them.’

source: །གང་གིས་ན་ཁྱེད་ཅག་དང་བདག་ཅག་ལེགས་པ་དང་། བདེ་བར་འཛམ་བུའི་གླིང་དུ་ཕྱིན་པར་འགྱུར་བའི་ཐབས་འགའ་ཅི་ཡོད། དེ་རྣམས་ཀྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Having been told this, the wise-natured merchant asked these many people, ‘Is there any good means whereby you and we can safely and securely return to the continent of Jambu?’

source: །ཀྱེ་ནང་རྗེ་རེ་ཞིག་བདག་ཅག་གང་གིས་ན་ལེགས་པ་དང་། བདེ་བར་འཛམ་བུའི་གླིང་དུ་ཕྱིན་པར་འགྱུར་བའི་ཐབས་ནི་ཅུང་ཟད་ཀྱང་ཁོ་བོ་ཅག་ལ་མེད་དེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “ ‘Good sir,’ they answered, ‘first, there is no means for us whereby we can safely and securely return to the continent of Jambu. Why?

source: གལ་ཏེ་བདག་ཅག་གིས་འདི་སྙམ་དུ་ཀྱེ་མ་བདག་ཅག་གིས་ལྕགས་ཀྱི་མཁར་འདི་ལས་རྒལ་ཏེ་འབྲོས་སོ་སྙམ་དུ་བསམས་ན། དེའི་ཉིས་གྱུར་རམ་དེའི་སུམ་གྱུར་གྱིས་མཐོན་པོར་འགྱུར་རོ། །གལ་ཏེ་བདག་ཅག་གིས་འདི་སྙམ་དུ།
en: If we think, “Oh, let’s climb over this iron castle and escape,” the castle becomes two or three times taller.

source: ཀྱེ་མ་བདག་ཅག་གིས་ལྕགས་ཀྱི་མཁར་འདིའི་གློ་ཕུག་སྟེ་འབྲོས་སོ་སྙམ་དུ་བསམས་ན། དེའི་ཉིས་གྱུར་རམ། དེའི་སུམ་གྱུར་གྱིས་ཞེང་དུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: If we think, “Oh, let’s break the side of this iron castle and escape,” the castle becomes two or three times thicker.

source: དེ་ལྟར་རེ་ཞིག་བདག་ཅག་ལེགས་པ་དང་། བདེ་བར་འཛམ་བུའི་གླིང་དུ་ཕྱིན་པར་འགྱུར་བའི་ཐབས་བདག་ཅག་ལ་མེད་དོ།
en: Thus, there is no means for us whereby we can safely and securely return to the continent of Jambu.

source: །འོན་ཀྱང་གང་གིས་ན་ཁྱོད་ཅག་ནི་སླར་ལེགས་པ་དང་། བདེ་བར་འཛམ་བུའི་གླིང་དུ་ཕྱིན་པར་འགྱུར་བའི་ཐབས་ཡོད་དེ།
en: However, there is a means whereby you can return to the continent of Jambu again.

source: འདི་ན་བདག་ཅག་གི་བར་སྣང་ལ་རྒྱུ་བའི་ལྷ་རྣམས་ཀྱེ་མ་འཛམ་བུའི་གླིང་གི་དོན་མཐུན་རྣམས་གསོ་སྦྱོང་བཅྭ་ལྔ་པ་དེ་ཉིད་ལ་བྱང་ཕྱོགས་ཀྱི་གསེབ་ལམ་གང་ན་རྟའི་རྒྱལ་པོ་སྤྲིན་གྱི་ཤུགས་ཅན་མ་རྨོས་མ་བཏབ་པའི་འབྲས་སཱ་ལུ་ཟ་བ་བདེ་བ་དང་། ནད་མེད་པ་དང་། སྟོབས་དང་ལྡན་པས་དབང་པོ་རྣམས་ཚིམ་པ།
en: We here have heard gods flying through the air utter these words: “Alas, merchants from the continent of Jambu! On the day of poṣadha that is the fifteenth of the month, on the northern secret path, Bālāha, the king of horses, eats rice that does not need plowing or sowing and becomes comfortable, free from illness, and strong. His faculties having become perfect, he raises his head and speaks an inspired utterance:

source: མགོ་འཕང་བསྟོད་དེ་ཕ་རོལ་དུ་འགྲོ་བ་ནི་སུ་ཡོད།
en: ‘Is there anyone going to the farther shore?

source: སུ་ནི་ཕ་རོལ་དུ་བཀྲི།
en: Whom shall I lead to the farther shore?

source: སུ་ནི་འཛམ་བུའི་གླིང་དུ་ལེགས་པ་དང་། བདེ་བར་ཕྱིན་པར་བྱ་ཞེས་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད་པ་ཡོད་པར་མི་འགྲོ་བ་ནི་བྱིས་པའོ་ཞེས་སྒྲ་འབྱིན་པ་ཐོས་ཀྱིས། ཁྱོད་དེའི་དྲུང་དུ་དེང་ལ་འདི་སྐད་ཅེས་བདག་ཅག་ཕ་རོལ་དུ་མཆིའོ།
en: Whom shall I take to the continent of Jambu safely and securely?’ It would be foolish not to go.” You should go to the horse and say, “We are going to the farther shore.

source: །བདག་ཅག་ཕ་རོལ་དུ་མཆི་སྟེ།
en: We are going to the farther shore.

source: བདག་ཅག་ཕ་རོལ་དུ་བཀྲི་ཞིང་ལེགས་པ་དང་བདེ་བར་འཛམ་བུའི་གླིང་དུ་ཕྱིན་པར་མཛད་དུ་གསོལ་ཞེས་སྨྲོས་ཤིག །དེ་ནས་ཚོང་པ་མཁས་པའི་རང་བཞིན་ཅན་གྱིས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་དེས་སྨྲས་པ་ཤིན་ཏུ་ལེགས་པར་བཟུང་སྟེ་ཆུབ་པར་བྱས་ནས།
en: Please lead us to the farther shore and take us to the continent of Jambu safely and securely.” ’ “Then, having well grasped and understood what the many people had said, the wise-natured merchant descended from the śirīṣa tree slowly and carefully.

source: བགས་ཀྱིས་དལ་བུས་དལ་བུས་ཤིང་ཤི་རི་ཤ་ལས་བབས་ནས་གཡས་ཕྱོགས་ཀྱི་ལམ་དེ་ཉིད་དུ་སོང་སྟེ། བུད་མེད་གང་དང་ལྷན་ཅིག་ཉལ་བ་དེ་མལ་ན་གཉིད་ཀྱིས་ལོག་པར་རིག་ནས་བགས་ཀྱིས་དལ་བུས་དལ་བུས་ཉལ་ལོ།
en: He went back along that southern road, confirmed that the woman with whom he slept was asleep in bed, and lay down slowly and carefully.

source: །དེ་ནས་ཚོང་པ་མཁས་པའི་རང་བཞིན་ཅན་གྱིས་དེ་ཉིད་ཀྱི་མཚན་མོ་འདས་པ་དང་། ནང་པར་སྔར་ལངས་ནས་འཛམ་བུའི་གླིང་གི་དོན་མཐུན་རབ་ཏུ་མང་པོ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། འཛམ་བུའི་གླིང་གི་དོན་མཐུན་རབ་ཏུ་མང་པོ་རྣམས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then, after the night had passed, the wise-natured merchant rose in the morning and went to the many merchants from the continent of Jambu. When he arrived, he said to the many merchants from the continent of Jambu, ‘Sirs, come to the beautiful park immediately.

source: །ཤེས་ལྡན་དག་རེ་ཞིག་གང་ན་སྐྱེད་མོས་ཚལ་དབེན་པ་ཡོད་པ་ཞིག་ཏུ་ཤོག་ཤིག་དང་། ཁོ་བོས་ཁྱོད་ཅག་དང་ལྷན་ཅིག་གསང་སྟེ་གླེང་དགོས་པ་ཅུང་ཞིག་ཡོད་ཀྱིས།
en: I have something to talk about with you in confidence.

source: ཁྱེད་སུ་ཡང་སྨྱོས་ཀྱང་ཁྱེའུའམ་བུ་མོ་ནི་ཁྲིད་དེ་མ་འོང་ཤིག །ཤེས་ལྡན་དག་དེ་བཞིན་དུ་བགྱིའོ་ཞེས་འཛམ་བུའི་གླིང་གི་དོན་མཐུན་རབ་ཏུ་མང་པོ་རྣམས་ཀྱིས་མཉན་ཏོ།
en: Therefore, you should not tell anyone, nor should you bring your sons or daughters. Sirs, please do as I say.’ “The many merchants from the continent of Jambu heard this, and thereupon they went to the beautiful park.

source: །དེ་ནས་འཛམ་བུའི་གླིང་གི་དོན་མཐུན་རབ་ཏུ་མང་པོ་རྣམས་སྐྱེད་མོས་ཚལ་རབ་ཏུ་དབེན་པ་གང་ན་བ་དེར་དོང་བ་དང་། དེ་ནས་ཚོང་པ་མཁས་པའི་རང་བཞིན་ཅན་གྱིས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་དེ་དང་ལྷན་ཅིག་སྐབས་ཀྱི་གཏམ་ཇི་སྙེད་གླེངས་པ་དེ་དག་འཛམ་བུའི་གླིང་གི་དོན་མཐུན་རབ་ཏུ་མང་པོ་རྣམས་ལ་རྒྱས་པར་སྨྲས་ནས་འདི་སྐད་ཅེས་ཀྱང་སྨྲས་ཏེ། འདི་དག་ནི་བུད་མེད་མ་ཡིན་ཏེ། འདི་དག་སྲིན་མོ་ཡིན་གྱིས།
en: Then the wise-natured merchant told the many merchants from the continent of Jambu everything about the conversation he had had with those many people and said, ‘These women are not humans, but rākṣasīs.

source: ཤེས་ལྡན་དག་འདི་ལས་བདག་ཉིད་བསྲུང་བར་གྱིས་ཤིག །དེ་ནས་འཛམ་བུའི་གླིང་གི་དོན་མཐུན་རབ་ཏུ་མང་པོ་རྣམས་དེ་བཞིན་དུ་གསོ་སྦྱོང་བཅྭ་ལྔ་པ་དེ་ཉིད་ལ་བྱང་ཕྱོགས་ཀྱི་གསེབ་ལམ་གང་ན་རྟའི་རྒྱལ་པོ་སྤྲིན་གྱི་ཤུགས་ཅན་མ་རྨོས་མ་བཏབ་པའི་འབྲས་སཱ་ལུ་ཟ་བ་བདེ་བ་དང་། ནད་མེད་པ་དང་། སྟོབས་དང་ལྡན་པས་དབང་པོ་རྣམས་ཚིམ་པ་མགོ་འཕང་བསྟོད་དེ་ཕ་རོལ་དུ་འགྲོ་བ་ནི་སུ་ཞིག་ཡོད།
en: Thus, sirs, protect yourselves from them.’ “Then, just as they had been told, on the day of poṣadha that is the fifteenth of the month, the many merchants from the continent of Jambu went to the northern secret path where Bālāha, the king of horses, ate rice that does not need plowing or sowing and became comfortable, free from illness, and strong. His faculties having become perfect, he raised his head and spoke an inspired utterance: ‘Is there anyone going to the farther shore?
